In [1]:
import numpy as np
import pandas as pd

In [4]:
data = {"names": ["Kilho","Kilho","Kilho","Charles","Charles"],
       "year": [2014, 2015, 2016, 2015, 2016],
       "points":[1.5,1.7,3.6,2.4,2.9]}
df = pd.DataFrame(data, columns = ["year","names","points","penalty"],
                 index = ["one","two","three","four","five"])

In [5]:
df

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [6]:
df["year"]

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [7]:
df.year

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [9]:
df[["year","points"]]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9

In [10]:
df["penalty"] = 0.5

In [11]:
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.5
two    2015    Kilho     1.7      0.5
three  2016    Kilho     3.6      0.5
four   2015  Charles     2.4      0.5
five   2016  Charles     2.9      0.5

In [12]:
df["penalty"] = [0.1, 0.2, 0.3, 0.4, 0.5]

In [13]:
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.1
two    2015    Kilho     1.7      0.2
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [15]:
df["zeros"] = np.arange(5)

In [16]:
df

       year    names  points  penalty  zeros
one    2014    Kilho     1.5      0.1      0
two    2015    Kilho     1.7      0.2      1
three  2016    Kilho     3.6      0.3      2
four   2015  Charles     2.4      0.4      3
five   2016  Charles     2.9      0.5      4

In [17]:
val = pd.Series([-1.2, -1.5, -1.7], index = ["two","four","five"])

In [18]:
df["debt"] = val

In [19]:
df

       year    names  points  penalty  zeros  debt
one    2014    Kilho     1.5      0.1      0   NaN
two    2015    Kilho     1.7      0.2      1  -1.2
three  2016    Kilho     3.6      0.3      2   NaN
four   2015  Charles     2.4      0.4      3  -1.5
five   2016  Charles     2.9      0.5      4  -1.7

In [21]:
df["net_points"] = df["points"] - df["penalty"]

In [22]:
df["hight_points"] = df["net_points"] > 2.0

In [23]:
df

       year    names  points  penalty  zeros  debt  net_points  hight_points
one    2014    Kilho     1.5      0.1      0   NaN         1.4         False
two    2015    Kilho     1.7      0.2      1  -1.2         1.5         False
three  2016    Kilho     3.6      0.3      2   NaN         3.3          True
four   2015  Charles     2.4      0.4      3  -1.5         2.0         False
five   2016  Charles     2.9      0.5      4  -1.7         2.4          True

In [25]:
del df["hight_points"]

In [26]:
del df["net_points"]

In [27]:
del df["zeros"]

In [28]:
df

       year    names  points  penalty  debt
one    2014    Kilho     1.5      0.1   NaN
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5
five   2016  Charles     2.9      0.5  -1.7

In [29]:
df.columns

Index(['year', 'names', 'points', 'penalty', 'debt'], dtype='object')

In [30]:
df.index.name= "Order"
df.columns.name = "Info"

In [31]:
df

Info   year    names  points  penalty  debt
Order
one    2014    Kilho     1.5      0.1   NaN
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5
five   2016  Charles     2.9      0.5  -1.7

In [32]:
df[0:3]

Info   year  names  points  penalty  debt
Order
one    2014  Kilho     1.5      0.1   NaN
two    2015  Kilho     1.7      0.2  -1.2
three  2016  Kilho     3.6      0.3   NaN

In [33]:
df["two":"four"] #비추천-혼란을 가져올 수 있다

Info   year    names  points  penalty  debt
Order
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5

In [34]:
df.loc["two"] #추천

Info
year        2015
names      Kilho
points       1.7
penalty      0.2
debt        -1.2
Name: two, dtype: object

In [35]:
df.loc["two":"four"]

Info   year    names  points  penalty  debt
Order
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5

In [37]:
df.loc["two":"four","names"]

Order
two        Kilho
three      Kilho
four     Charles
Name: names, dtype: object

In [38]:
df.loc[:,"year"]

Order
one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [40]:
df.loc[:,["year","names"]]

Info   year    names
Order
one    2014    Kilho
two    2015    Kilho
three  2016    Kilho
four   2015  Charles
five   2016  Charles

In [41]:
df.loc["three":"five","year":"penalty"]

Info   year    names  points  penalty
Order
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [42]:
df.loc["six",:]=[2013,"Hayoung",4.0,0.1,2.1]

In [43]:
df

Info     year    names  points  penalty  debt
Order
one    2014.0    Kilho     1.5      0.1   NaN
two    2015.0    Kilho     1.7      0.2  -1.2
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7
six    2013.0  Hayoung     4.0      0.1   2.1

In [44]:
df.iloc[3]

Info
year          2015
names      Charles
points         2.4
penalty        0.4
debt          -1.5
Name: four, dtype: object

In [46]:
df.iloc[3:5, 0:2]

Info     year    names
Order
four   2015.0  Charles
five   2016.0  Charles

In [47]:
df.iloc[[0,1,3],[1,2]]

Info     names  points
Order
one      Kilho     1.5
two      Kilho     1.7
four   Charles     2.4

In [48]:
df.iloc[:,1:4]

Info     names  points  penalty
Order
one      Kilho     1.5      0.1
two      Kilho     1.7      0.2
three    Kilho     3.6      0.3
four   Charles     2.4      0.4
five   Charles     2.9      0.5
six    Hayoung     4.0      0.1

In [49]:
df.iloc[1,1]

'Kilho'

In [50]:
#loc와 .iloc 사용을 해야 혼란이 적다

In [51]:
df.year > 2014

Order
one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [52]:
df.loc[df.year>2014, :]

Info     year    names  points  penalty  debt
Order
two    2015.0    Kilho     1.7      0.2  -1.2
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7

In [53]:
df.loc[df.names == "Kilho", ["names","points"]]

Info   names  points
Order
one    Kilho     1.5
two    Kilho     1.7
three  Kilho     3.6

In [56]:
df.loc[(df.points>2) & (df.points < 3), :]

Info     year    names  points  penalty  debt
Order
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7

In [57]:
df.loc[(df.points > 3), "penalty"] = 0

In [58]:
df

Info     year    names  points  penalty  debt
Order
one    2014.0    Kilho     1.5      0.1   NaN
two    2015.0    Kilho     1.7      0.2  -1.2
three  2016.0    Kilho     3.6      0.0   NaN
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7
six    2013.0  Hayoung     4.0      0.0   2.1